In [2]:
import pandas as pd 
import numpy as  np

In [4]:
dt = {'name':['rohit','mohit','shyam'],'branch':['cse','it','ece'],'roll_no':[25,41,63]}
dt

{'name': ['rohit', 'mohit', 'shyam'],
 'branch': ['cse', 'it', 'ece'],
 'roll_no': [25, 41, 63]}

In [5]:
df = pd.DataFrame(dt)
df

    name branch  roll_no
0  rohit    cse       25
1  mohit     it       41
2  shyam    ece       63

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df.dtypes   # object ---> string , # int64 --> int

name       object
branch     object
roll_no     int64
dtype: object

In [ ]:
# dataframe collection of series

In [19]:
arr = np.random.randint(1,50,20)
arr

array([ 4, 16, 19, 36,  6, 43, 11, 38, 38, 38, 14,  6,  1, 31,  9,  1, 25,
       48, 42,  8])

In [9]:
type(arr)

numpy.ndarray

In [20]:
ser1 = pd.Series(arr,name='random_number1')
ser2 = pd.Series(arr,name='random_number2')

In [22]:
ser2

0      4
1     16
2     19
3     36
4      6
5     43
6     11
7     38
8     38
9     38
10    14
11     6
12     1
13    31
14     9
15     1
16    25
17    48
18    42
19     8
Name: random_number2, dtype: int32

In [14]:
type(ser2)

pandas.core.series.Series

In [28]:
# ser1 + ser2  
pd.concat([ser1,ser2] , axis=1)

    random_number1  random_number2
0                4               4
1               16              16
2               19              19
3               36              36
4                6               6
5               43              43
6               11              11
7               38              38
8               38              38
9               38              38
10              14              14
11               6               6
12               1               1
13              31              31
14               9               9
15               1               1
16              25              25
17              48              48
18              42              42
19               8               8

In [29]:
df = pd.read_csv("Used_Bikes.csv")
df

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
...,...,...,...,...,...,...,...,...
32643,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero
32644,TVS Apache RTR 180cc,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS
32645,Bajaj Avenger Street 220,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero
32647,Bajaj Pulsar 150cc,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj

In [30]:
df.head()  # top 5 rows

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha

In [31]:
df.head(10)

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
5,Yamaha FZs 150cc,53499.0,Delhi,25000.0,First Owner,6.0,150.0,Yamaha
6,Honda CB Hornet 160R ABS DLX,85000.0,Delhi,8200.0,First Owner,3.0,160.0,Honda
7,Hero Splendor Plus Self Alloy 100cc,45000.0,Delhi,12645.0,First Owner,3.0,100.0,Hero
8,Royal Enfield Thunderbird X 350cc,145000.0,Bangalore,9190.0,First Owner,3.0,350.0,Royal Enfield
9,Royal Enfield Classic Desert Storm 500cc,88000.0,Delhi,19000.0,Second Owner,7.0,500.0,Royal Enfield

In [33]:
df.tail(10)

,bike_name,price,city,kms_driven,owner,age,power,brand
32638,Yamaha Fazer 25 250cc,123000.0,Kadapa,14500.0,First Owner,4.0,250.0,Yamaha
32639,Royal Enfield Classic 350cc,95500.0,Delhi,18000.0,First Owner,8.0,350.0,Royal Enfield
32640,Hero Passion Pro 100cc,32000.0,Delhi,12000.0,First Owner,6.0,100.0,Hero
32641,Bajaj Avenger 220cc,41000.0,Delhi,20245.0,Second Owner,11.0,220.0,Bajaj
32642,Hero Passion 100cc,15000.0,Perumbavoor,35000.0,Second Owner,19.0,100.0,Hero
32643,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero
32644,TVS Apache RTR 180cc,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS
32645,Bajaj Avenger Street 220,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero
32647,Bajaj Pulsar 150cc,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj

In [34]:
df.shape

(32648, 8)

In [35]:
df.dtypes

bike_name      object
price         float64
city           object
kms_driven    float64
owner          object
age           float64
power         float64
brand          object
dtype: object

In [36]:
df.info()  # tell me

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32648 entries, 0 to 32647
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   32648 non-null  object
 1   price       32648 non-null  float64
 2   city        32648 non-null  object
 3   kms_driven  32648 non-null  float64
 4   owner       32648 non-null  object
 5   age         32648 non-null  float64
 6   power       32648 non-null  float64
 7   brand       32648 non-null  object
dtypes: float64(4), object(4)
memory usage: 2.0+ MB

In [47]:
### DATA ACCESSINg  # column wise 
df[['price','city','age']]

          price       city   age
0       35000.0  Ahmedabad   3.0
1      119900.0      Delhi   4.0
2      600000.0      Delhi   8.0
3       65000.0  Bangalore   4.0
4       80000.0  Bangalore   3.0
...         ...        ...   ...
32643   39000.0      Delhi   4.0
32644   30000.0     Karnal   9.0
32645   60000.0      Delhi   6.0
32646   15600.0     Jaipur  16.0
32647   22000.0       Pune  13.0

[32648 rows x 3 columns]

In [49]:
# df['city']  
df.city

0        Ahmedabad
1            Delhi
2            Delhi
3        Bangalore
4        Bangalore
           ...
32643        Delhi
32644       Karnal
32645        Delhi
32646       Jaipur
32647         Pune
Name: city, Length: 32648, dtype: object

In [53]:
a = df[['price','city','age']]
a.head(10)

      price       city  age
0   35000.0  Ahmedabad  3.0
1  119900.0      Delhi  4.0
2  600000.0      Delhi  8.0
3   65000.0  Bangalore  4.0
4   80000.0  Bangalore  3.0
5   53499.0      Delhi  6.0
6   85000.0      Delhi  3.0
7   45000.0      Delhi  3.0
8  145000.0  Bangalore  3.0
9   88000.0      Delhi  7.0

In [54]:
## loc , iloc   # column wise , row wise 

df.loc[5]   # particular row record

bike_name     Yamaha FZs 150cc
price                  53499.0
city                     Delhi
kms_driven             25000.0
owner              First Owner
age                        6.0
power                    150.0
brand                   Yamaha
Name: 5, dtype: object

In [55]:
df.head(10)

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
5,Yamaha FZs 150cc,53499.0,Delhi,25000.0,First Owner,6.0,150.0,Yamaha
6,Honda CB Hornet 160R ABS DLX,85000.0,Delhi,8200.0,First Owner,3.0,160.0,Honda
7,Hero Splendor Plus Self Alloy 100cc,45000.0,Delhi,12645.0,First Owner,3.0,100.0,Hero
8,Royal Enfield Thunderbird X 350cc,145000.0,Bangalore,9190.0,First Owner,3.0,350.0,Royal Enfield
9,Royal Enfield Classic Desert Storm 500cc,88000.0,Delhi,19000.0,Second Owner,7.0,500.0,Royal Enfield

In [57]:
df.loc[0:10,['bike_name','price','city']]   #

                                   bike_name     price       city
0         TVS Star City Plus Dual Tone 110cc   35000.0  Ahmedabad
1                Royal Enfield Classic 350cc  119900.0      Delhi
2                       Triumph Daytona 675R  600000.0      Delhi
3                       TVS Apache RTR 180cc   65000.0  Bangalore
4       Yamaha FZ S V 2.0 150cc-Ltd. Edition   80000.0  Bangalore
5                           Yamaha FZs 150cc   53499.0      Delhi
6              Honda CB Hornet 160R  ABS DLX   85000.0      Delhi
7        Hero Splendor Plus Self Alloy 100cc   45000.0      Delhi
8          Royal Enfield Thunderbird X 350cc  145000.0  Bangalore
9   Royal Enfield Classic Desert Storm 500cc   88000.0      Delhi
10                  Yamaha YZF-R15 2.0 150cc   72000.0  Bangalore

In [60]:
df.iloc[0:10,1:3]

      price       city
0   35000.0  Ahmedabad
1  119900.0      Delhi
2  600000.0      Delhi
3   65000.0  Bangalore
4   80000.0  Bangalore
5   53499.0      Delhi
6   85000.0      Delhi
7   45000.0      Delhi
8  145000.0  Bangalore
9   88000.0      Delhi

In [62]:
df.iloc[10:21,6:]

    power    brand
10  150.0   Yamaha
11  250.0   Yamaha
12  200.0    Bajaj
13  100.0    Bajaj
14  125.0    Bajaj
15  200.0    Bajaj
16  200.0    Bajaj
17  150.0   Suzuki
18  302.0  Benelli
19  125.0    Bajaj
20  200.0    Bajaj

In [66]:
df.iloc[0:10]

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
5,Yamaha FZs 150cc,53499.0,Delhi,25000.0,First Owner,6.0,150.0,Yamaha
6,Honda CB Hornet 160R ABS DLX,85000.0,Delhi,8200.0,First Owner,3.0,160.0,Honda
7,Hero Splendor Plus Self Alloy 100cc,45000.0,Delhi,12645.0,First Owner,3.0,100.0,Hero
8,Royal Enfield Thunderbird X 350cc,145000.0,Bangalore,9190.0,First Owner,3.0,350.0,Royal Enfield
9,Royal Enfield Classic Desert Storm 500cc,88000.0,Delhi,19000.0,Second Owner,7.0,500.0,Royal Enfield

In [ ]:
# single column , multiple column
# particular row ,  group of row 
# desired no.of row and no of columns

In [ ]:
bike_name	price	city   ===> 100, 200

In [69]:
manager_bhaiya = df.loc[100:200,["bike_name"	,"price","city"]]

In [71]:
manager_bhaiya.to_csv("manager_data.csv",index=False)

In [75]:
### condition wise filter
# brand == "Royal Enfield"

royal_enfield = df[df['brand'] == "Royal Enfield"]
royal_enfield

,bike_name,price,city,kms_driven,owner,age,power,brand
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
8,Royal Enfield Thunderbird X 350cc,145000.0,Bangalore,9190.0,First Owner,3.0,350.0,Royal Enfield
9,Royal Enfield Classic Desert Storm 500cc,88000.0,Delhi,19000.0,Second Owner,7.0,500.0,Royal Enfield
23,Royal Enfield Classic Chrome 500cc,121700.0,Kalyan,24520.0,First Owner,5.0,500.0,Royal Enfield
36,Royal Enfield Classic 350cc,98800.0,Kochi,39000.0,First Owner,5.0,350.0,Royal Enfield
...,...,...,...,...,...,...,...,...
32601,Royal Enfield Classic 350cc,95500.0,Delhi,18000.0,First Owner,8.0,350.0,Royal Enfield
32614,Royal Enfield Bullet Electra 350cc,105000.0,Delhi,20000.0,First Owner,4.0,350.0,Royal Enfield
32633,Royal Enfield Classic 350cc,87000.0,Gautam Buddha Nagar,16336.0,First Owner,7.0,350.0,Royal Enfield
32634,Royal Enfield Thunderbird 350cc,70000.0,Mumbai,13858.0,Second Owner,11.0,350.0,Royal Enfield
32639,Royal Enfield Classic 350cc,95500.0,Delhi,18000.0,First Owner,8.0,350.0,Royal Enfield

In [80]:
royal_enfield[royal_enfield['city'] == "Delhi"]

,bike_name,price,city,kms_driven,owner,age,power,brand
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
9,Royal Enfield Classic Desert Storm 500cc,88000.0,Delhi,19000.0,Second Owner,7.0,500.0,Royal Enfield
44,Royal Enfield Classic 350cc,85000.0,Delhi,18000.0,First Owner,6.0,350.0,Royal Enfield
51,Royal Enfield‎ Bullet 350cc,90000.0,Delhi,15300.0,First Owner,7.0,350.0,Royal Enfield
62,Royal Enfield Bullet Electra 350cc,107100.0,Delhi,15438.0,Second Owner,3.0,350.0,Royal Enfield
...,...,...,...,...,...,...,...,...
32563,Royal Enfield Classic 350cc,95500.0,Delhi,18000.0,First Owner,8.0,350.0,Royal Enfield
32582,Royal Enfield Classic 350cc,95500.0,Delhi,18000.0,First Owner,8.0,350.0,Royal Enfield
32601,Royal Enfield Classic 350cc,95500.0,Delhi,18000.0,First Owner,8.0,350.0,Royal Enfield
32614,Royal Enfield Bullet Electra 350cc,105000.0,Delhi,20000.0,First Owner,4.0,350.0,Royal Enfield
32639,Royal Enfield Classic 350cc,95500.0,Delhi,18000.0,First Owner,8.0,350.0,Royal Enfield

In [85]:
# brand = royal enfield 
# city = Delhi 
# price <= 100000
# multiple condition   gate operatin and , or  

royal_enfiled = df[(df['brand']=="Royal Enfield")&(df['city']=="Delhi")&(df['price']<=100000)].loc[0:,['kms_driven','price']]
# bike_name , price , kms_driven

In [84]:
royal_enfiled[['bike_name','price','kms_driven']]

                                      bike_name    price  kms_driven
9      Royal Enfield Classic Desert Storm 500cc  88000.0     19000.0
44                  Royal Enfield Classic 350cc  85000.0     18000.0
51                  Royal Enfield‎ Bullet 350cc  90000.0     15300.0
64              Royal Enfield Thunderbird 350cc  88000.0     19000.0
126                 Royal Enfield Classic 350cc  92500.0     11000.0
...                                         ...      ...         ...
32544               Royal Enfield Classic 350cc  95500.0     18000.0
32563               Royal Enfield Classic 350cc  95500.0     18000.0
32582               Royal Enfield Classic 350cc  95500.0     18000.0
32601               Royal Enfield Classic 350cc  95500.0     18000.0
32639               Royal Enfield Classic 350cc  95500.0     18000.0

[803 rows x 3 columns]

In [86]:
df[(df['brand']=="Royal Enfield")&(df['city']=="Delhi")&(df['price']<=100000)].loc[0:,['kms_driven','price']]
# bike_name

       kms_driven    price
9         19000.0  88000.0
44        18000.0  85000.0
51        15300.0  90000.0
64        19000.0  88000.0
126       11000.0  92500.0
...           ...      ...
32544     18000.0  95500.0
32563     18000.0  95500.0
32582     18000.0  95500.0
32601     18000.0  95500.0
32639     18000.0  95500.0

[803 rows x 2 columns]

In [90]:
df['city'].value_counts()

city
Delhi            7318
Bangalore        2723
Mumbai           2591
Hyderabad        2160
Pune             1724
                 ...
Surendranagar       1
Khandela            1
Mohammadabad        1
Shimla              1
Sidhi               1
Name: count, Length: 443, dtype: int64

In [94]:
# df[()|()]

# brand = KTM ,
# city = Jaipur, 

df[(df['brand'] == "KTM") & (df['city']=="Jaipur")]
# no. of row or no of bikes that are present at the jaipur location

,bike_name,price,city,kms_driven,owner,age,power,brand
888,KTM RC 390cc,147000.0,Jaipur,15000.0,First Owner,6.0,390.0,KTM
4945,KTM Duke 390cc,200000.0,Jaipur,11700.0,First Owner,4.0,390.0,KTM
4948,KTM RC 390cc,175000.0,Jaipur,10880.0,First Owner,4.0,390.0,KTM
6073,KTM RC 200cc,190000.0,Jaipur,7902.0,First Owner,2.0,200.0,KTM
6159,KTM Duke 250cc,135000.0,Jaipur,12507.0,First Owner,4.0,250.0,KTM
6552,KTM RC 200cc,190000.0,Jaipur,7902.0,First Owner,2.0,200.0,KTM
6734,KTM RC 200cc,128000.0,Jaipur,15000.0,First Owner,4.0,200.0,KTM
7561,KTM Duke 250cc,150000.0,Jaipur,12500.0,First Owner,4.0,250.0,KTM

In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('Used_Bikes.csv')
df.head()

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha

In [5]:
df.columns

Index(['bike_name', 'price', 'city', 'kms_driven', 'owner', 'age', 'power',
       'brand'],
      dtype='object')

In [7]:
df.columns  = ['bike_name', 'price', 'city', 'kms_driven', 'ownership', 'bike_age', 'bike_power',
       'brand']

In [8]:
df.rename()

,bike_name,price,city,kms_driven,ownership,bike_age,bike_power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha

In [10]:
df.index

RangeIndex(start=0, stop=32648, step=1)

In [12]:
delhi = df[df['city'] == 'Delhi']

In [16]:
delhi.reset_index(drop=True)

,bike_name,price,city,kms_driven,ownership,bike_age,bike_power,brand
0,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
1,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
2,Yamaha FZs 150cc,53499.0,Delhi,25000.0,First Owner,6.0,150.0,Yamaha
3,Honda CB Hornet 160R ABS DLX,85000.0,Delhi,8200.0,First Owner,3.0,160.0,Honda
4,Hero Splendor Plus Self Alloy 100cc,45000.0,Delhi,12645.0,First Owner,3.0,100.0,Hero
...,...,...,...,...,...,...,...,...
7313,Royal Enfield Classic 350cc,95500.0,Delhi,18000.0,First Owner,8.0,350.0,Royal Enfield
7314,Hero Passion Pro 100cc,32000.0,Delhi,12000.0,First Owner,6.0,100.0,Hero
7315,Bajaj Avenger 220cc,41000.0,Delhi,20245.0,Second Owner,11.0,220.0,Bajaj
7316,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero
7317,Bajaj Avenger Street 220,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj

In [19]:
jaipur = df[df['city'] == "Jaipur"]   # ascending order by the price column

In [22]:
jaipur.sort_values(by='price')  # by default sort in ascending order

,bike_name,price,city,kms_driven,ownership,bike_age,bike_power,brand
9029,Hero Passion 100cc,14000.0,Jaipur,50000.0,Second Owner,19.0,100.0,Hero
3654,Hero Passion Plus 100cc,14000.0,Jaipur,70756.0,First Owner,13.0,100.0,Hero
2696,Hero Passion Plus 100cc,14000.0,Jaipur,70756.0,First Owner,13.0,100.0,Hero
3365,Hero Super Splendor 125cc,15000.0,Jaipur,52391.0,First Owner,15.0,125.0,Hero
3113,Bajaj CT 100 100cc,15000.0,Jaipur,48000.0,First Owner,17.0,100.0,Bajaj
...,...,...,...,...,...,...,...,...
3826,Harley-Davidson Street 750,445600.0,Jaipur,1500.0,First Owner,5.0,750.0,Harley-Davidson
2599,Harley-Davidson Street 750,445600.0,Jaipur,1500.0,First Owner,5.0,750.0,Harley-Davidson
7650,Kawasaki Z650,478000.0,Jaipur,1234.0,First Owner,3.0,650.0,Kawasaki
9187,Harley-Davidson Street 750 ABS,520000.0,Jaipur,399.0,First Owner,2.0,750.0,Harley-Davidson
617,Suzuki Hayabusa 1300cc,1260000.0,Jaipur,17000.0,First Owner,4.0,1300.0,Suzuki

In [24]:
jaipur.sort_values(by='price',ascending=False)

,bike_name,price,city,kms_driven,ownership,bike_age,bike_power,brand
617,Suzuki Hayabusa 1300cc,1260000.0,Jaipur,17000.0,First Owner,4.0,1300.0,Suzuki
9187,Harley-Davidson Street 750 ABS,520000.0,Jaipur,399.0,First Owner,2.0,750.0,Harley-Davidson
7650,Kawasaki Z650,478000.0,Jaipur,1234.0,First Owner,3.0,650.0,Kawasaki
2599,Harley-Davidson Street 750,445600.0,Jaipur,1500.0,First Owner,5.0,750.0,Harley-Davidson
3826,Harley-Davidson Street 750,445600.0,Jaipur,1500.0,First Owner,5.0,750.0,Harley-Davidson
...,...,...,...,...,...,...,...,...
3113,Bajaj CT 100 100cc,15000.0,Jaipur,48000.0,First Owner,17.0,100.0,Bajaj
2983,Bajaj CT 100 100cc,15000.0,Jaipur,48000.0,First Owner,17.0,100.0,Bajaj
9029,Hero Passion 100cc,14000.0,Jaipur,50000.0,Second Owner,19.0,100.0,Hero
3654,Hero Passion Plus 100cc,14000.0,Jaipur,70756.0,First Owner,13.0,100.0,Hero
2696,Hero Passion Plus 100cc,14000.0,Jaipur,70756.0,First Owner,13.0,100.0,Hero

In [ ]:
# find out all those bike records , that are present at jaipur location , top 10 price bike highest

In [28]:
jaipur.sort_values(by='price',ascending=False).head(10)

,bike_name,price,city,kms_driven,ownership,bike_age,bike_power,brand
617,Suzuki Hayabusa 1300cc,1260000.0,Jaipur,17000.0,First Owner,4.0,1300.0,Suzuki
9187,Harley-Davidson Street 750 ABS,520000.0,Jaipur,399.0,First Owner,2.0,750.0,Harley-Davidson
7650,Kawasaki Z650,478000.0,Jaipur,1234.0,First Owner,3.0,650.0,Kawasaki
2599,Harley-Davidson Street 750,445600.0,Jaipur,1500.0,First Owner,5.0,750.0,Harley-Davidson
3826,Harley-Davidson Street 750,445600.0,Jaipur,1500.0,First Owner,5.0,750.0,Harley-Davidson
189,Harley-Davidson Iron 883,435000.0,Jaipur,5550.0,Second Owner,7.0,883.0,Harley-Davidson
3811,Harley-Davidson Street 750,382000.0,Jaipur,10000.0,First Owner,7.0,750.0,Harley-Davidson
4817,Harley-Davidson Street 750,350000.0,Jaipur,8600.0,First Owner,7.0,750.0,Harley-Davidson
4720,Harley-Davidson Street 750,350000.0,Jaipur,8600.0,First Owner,7.0,750.0,Harley-Davidson
3794,Harley-Davidson Street 750,345000.0,Jaipur,10619.0,First Owner,6.0,750.0,Harley-Davidson

In [30]:
# column add , column delete 
df2 = df[['bike_name','price']]

                                  bike_name     price
0        TVS Star City Plus Dual Tone 110cc   35000.0
1               Royal Enfield Classic 350cc  119900.0
2                      Triumph Daytona 675R  600000.0
3                      TVS Apache RTR 180cc   65000.0
4      Yamaha FZ S V 2.0 150cc-Ltd. Edition   80000.0
...                                     ...       ...
32643                Hero Passion Pro 100cc   39000.0
32644                  TVS Apache RTR 180cc   30000.0
32645              Bajaj Avenger Street 220   60000.0
32646             Hero Super Splendor 125cc   15600.0
32647                    Bajaj Pulsar 150cc   22000.0

[32648 rows x 2 columns]

In [36]:
df2 = df.drop(['bike_name','kms_driven'],axis='columns')
df2.head()

      price       city    ownership  bike_age  bike_power          brand
0   35000.0  Ahmedabad  First Owner       3.0       110.0            TVS
1  119900.0      Delhi  First Owner       4.0       350.0  Royal Enfield
2  600000.0      Delhi  First Owner       8.0       675.0        Triumph
3   65000.0  Bangalore  First Owner       4.0       180.0            TVS
4   80000.0  Bangalore  First Owner       3.0       150.0         Yamaha

In [37]:
# df = df.drop(['bike_name','kms_driven'],axis='columns') 
df.drop(['bike_name','kms_driven'],axis='columns',inplace=True)

          price       city    ownership  bike_age  bike_power          brand
0       35000.0  Ahmedabad  First Owner       3.0       110.0            TVS
1      119900.0      Delhi  First Owner       4.0       350.0  Royal Enfield
2      600000.0      Delhi  First Owner       8.0       675.0        Triumph
3       65000.0  Bangalore  First Owner       4.0       180.0            TVS
4       80000.0  Bangalore  First Owner       3.0       150.0         Yamaha
...         ...        ...          ...       ...         ...            ...
32643   39000.0      Delhi  First Owner       4.0       100.0           Hero
32644   30000.0     Karnal  First Owner       9.0       180.0            TVS
32645   60000.0      Delhi  First Owner       6.0       220.0          Bajaj
32646   15600.0     Jaipur  First Owner      16.0       125.0           Hero
32647   22000.0       Pune  First Owner      13.0       150.0          Bajaj

[32648 rows x 6 columns]

In [41]:
# column add , delete  
df['dummy'] = 1

In [43]:
df['dummy'] = 10

In [46]:
df['price_incre_5k'] = df['price'] + 5000

In [48]:
df[['price','price_incre_5k']]

          price  price_incre_5k
0       35000.0         40000.0
1      119900.0        124900.0
2      600000.0        605000.0
3       65000.0         70000.0
4       80000.0         85000.0
...         ...             ...
32643   39000.0         44000.0
32644   30000.0         35000.0
32645   60000.0         65000.0
32646   15600.0         20600.0
32647   22000.0         27000.0

[32648 rows x 2 columns]

In [61]:
# df 
# quantity , price  = total_price (quantity * price ) 
# python  
# df['bike_age'].min()  
# df 
# price less than 50k normal or middle class bike 
# price greater than 50K and  less than 1 lakh  --> high level bikes 
# 1 lakhs highest == > super bike 

# python  
ls = []
for price in df['price']: 
    if price <=50000: 
        ls.append('middle class bike')
    elif price > 50000 and price < 100000: 
        ls.append('high class bike')
    elif price> 100000: 
        ls.append("super bike")
    else:
        ls.append('i dont know')

# rename , cut()

In [62]:
df['bike_class'] = ls

In [64]:
df[['price','bike_class']]

          price         bike_class
0       35000.0  middle class bike
1      119900.0         super bike
2      600000.0         super bike
3       65000.0    high class bike
4       80000.0    high class bike
...         ...                ...
32643   39000.0  middle class bike
32644   30000.0  middle class bike
32645   60000.0    high class bike
32646   15600.0  middle class bike
32647   22000.0  middle class bike

[32648 rows x 2 columns]

In [ ]:
## delete column , add new column  # feature(column) engineering

In [72]:
# df[(df['city'] =='Jaipur') | (df['city']=='Ahmedabad')] 
ls = ['Jaipur','Delhi']
df[df['city'].isin(ls)]

,bike_name,price,city,kms_driven,ownership,bike_age,bike_power,brand,dummy,price_incre_5k,bike_class
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield,10,124900.0,super bike
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph,10,605000.0,super bike
5,Yamaha FZs 150cc,53499.0,Delhi,25000.0,First Owner,6.0,150.0,Yamaha,10,58499.0,high class bike
6,Honda CB Hornet 160R ABS DLX,85000.0,Delhi,8200.0,First Owner,3.0,160.0,Honda,10,90000.0,high class bike
7,Hero Splendor Plus Self Alloy 100cc,45000.0,Delhi,12645.0,First Owner,3.0,100.0,Hero,10,50000.0,middle class bike
...,...,...,...,...,...,...,...,...,...,...,...
32640,Hero Passion Pro 100cc,32000.0,Delhi,12000.0,First Owner,6.0,100.0,Hero,10,37000.0,middle class bike
32641,Bajaj Avenger 220cc,41000.0,Delhi,20245.0,Second Owner,11.0,220.0,Bajaj,10,46000.0,middle class bike
32643,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero,10,44000.0,middle class bike
32645,Bajaj Avenger Street 220,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj,10,65000.0,high class bike
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero,10,20600.0,middle class bike

In [78]:
bike  = df[(df["brand"] == "KTM")]

bike[bike['price'] == bike['price'].max() ]

,bike_name,price,city,kms_driven,ownership,bike_age,bike_power,brand,dummy,price_incre_5k,bike_class
8197,KTM Duke 200cc,860000.0,Delhi,12000.0,Second Owner,5.0,200.0,KTM,10,865000.0,super bike

In [84]:
# df[df['city'] == "Jaipur"] 
df.query("city=='Jaipur'")

,bike_name,price,city,kms_driven,ownership,bike_age,bike_power,brand,dummy,price_incre_5k,bike_class
47,Mahindra Centuro NXT 110cc,28000.0,Jaipur,45000.0,First Owner,2.0,110.0,Mahindra,10,33000.0,middle class bike
134,Suzuki Gixxer SF 150cc,47000.0,Jaipur,70000.0,First Owner,6.0,150.0,Suzuki,10,52000.0,middle class bike
166,Royal Enfield Classic 350cc,123600.0,Jaipur,7702.0,First Owner,3.0,350.0,Royal Enfield,10,128600.0,super bike
189,Harley-Davidson Iron 883,435000.0,Jaipur,5550.0,Second Owner,7.0,883.0,Harley-Davidson,10,440000.0,super bike
490,Honda CBR 150R 150cc,55000.0,Jaipur,2000.0,First Owner,9.0,150.0,Honda,10,60000.0,high class bike
...,...,...,...,...,...,...,...,...,...,...,...
32551,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero,10,20600.0,middle class bike
32570,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero,10,20600.0,middle class bike
32589,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero,10,20600.0,middle class bike
32608,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero,10,20600.0,middle class bike
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero,10,20600.0,middle class bike

In [86]:
df['ownership'].value_counts()

ownership
First Owner             29964
Second Owner             2564
Third Owner               108
Fourth Owner Or More       12
Name: count, dtype: int64

In [89]:
list(df['ownership'].value_counts().keys())

['First Owner', 'Second Owner', 'Third Owner', 'Fourth Owner Or More']

In [90]:
list(df['ownership'].value_counts().values)

[29964, 2564, 108, 12]

In [92]:
df['brand'].nunique()

23

In [95]:
df['brand'].unique()

array(['TVS', 'Royal Enfield', 'Triumph', 'Yamaha', 'Honda', 'Hero',
       'Bajaj', 'Suzuki', 'Benelli', 'KTM', 'Mahindra', 'Kawasaki',
       'Ducati', 'Hyosung', 'Harley-Davidson', 'Jawa', 'BMW', 'Indian',
       'Rajdoot', 'LML', 'Yezdi', 'MV', 'Ideal'], dtype=object)

In [96]:
import numpy as np

## columns numerical

In [101]:
# df.dtypes 

# numerical , categorical 
cat_col = df.select_dtypes(include="O")  # categorical 
cat_col.head()

,bike_name,city,ownership,brand,bike_class
0,TVS Star City Plus Dual Tone 110cc,Ahmedabad,First Owner,TVS,middle class bike
1,Royal Enfield Classic 350cc,Delhi,First Owner,Royal Enfield,super bike
2,Triumph Daytona 675R,Delhi,First Owner,Triumph,super bike
3,TVS Apache RTR 180cc,Bangalore,First Owner,TVS,high class bike
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,Bangalore,First Owner,Yamaha,high class bike

In [102]:
num_col = df.select_dtypes(exclude="O")  # numerical  
num_col.head()

      price  kms_driven  bike_age  bike_power  dummy  price_incre_5k
0   35000.0     17654.0       3.0       110.0     10         40000.0
1  119900.0     11000.0       4.0       350.0     10        124900.0
2  600000.0       110.0       8.0       675.0     10        605000.0
3   65000.0     16329.0       4.0       180.0     10         70000.0
4   80000.0     10000.0       3.0       150.0     10         85000.0

In [110]:
num_col['price'] = num_col['price'].astype(int)

In [111]:
num_col.head()

    price  kms_driven  bike_age  bike_power  dummy  price_incre_5k
0   35000     17654.0       3.0       110.0     10         40000.0
1  119900     11000.0       4.0       350.0     10        124900.0
2  600000       110.0       8.0       675.0     10        605000.0
3   65000     16329.0       4.0       180.0     10         70000.0
4   80000     10000.0       3.0       150.0     10         85000.0

In [112]:
num_col['price'] = num_col['price'].astype(float)

In [116]:
var = 25.99
int(var)

25

In [117]:
df

,bike_name,price,city,kms_driven,ownership,bike_age,bike_power,brand,dummy,price_incre_5k,bike_class
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS,10,40000.0,middle class bike
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield,10,124900.0,super bike
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph,10,605000.0,super bike
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS,10,70000.0,high class bike
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha,10,85000.0,high class bike
...,...,...,...,...,...,...,...,...,...,...,...
32643,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero,10,44000.0,middle class bike
32644,TVS Apache RTR 180cc,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS,10,35000.0,middle class bike
32645,Bajaj Avenger Street 220,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj,10,65000.0,high class bike
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero,10,20600.0,middle class bike
32647,Bajaj Pulsar 150cc,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj,10,27000.0,middle class bike

In [120]:
# groupby  


df.agg({"price":'min','bike_age':'max'})

price       4400.0
bike_age      63.0
dtype: float64

In [124]:
df['price'].mean() # , mean , max , min

68295.41763660868

In [132]:
dt = {"price":"min","kms_driven":"max","bike_age":"mean"}
df['price'].agg(dt)

price         4.400000e+03
kms_driven    1.900000e+06
bike_age      6.829542e+04
Name: price, dtype: float64

In [134]:
df['price'].agg(dt).values

array([   4400.        , 1900000.        ,   68295.41763661])

In [ ]:
# pandas  
# group by  
# pandas  pandas 
# project  cli